app/controllers/school_classes_controller.rb

  def index
    @school_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title"], ["room_number", 100], ["created_at", "2020-12-18 03:37:47.023686"], ["updated_at", "2020-12-18 03:37:47.023686"]]

  def update
    @school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Data Analyst"], ["room_number", 200], ["updated_at", "2020-12-18 03:50:41.404972"], ["id", 1]]

  def set_school_class
    @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]