app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params(:first_name, :last_name))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Thomas"], ["last_name", "Tsue"], ["created_at", "2020-12-18 04:15:37.421497"], ["updated_at", "2020-12-18 04:15:37.421497"]]

  def update
    @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Brenda UPDATED"], ["updated_at", "2020-12-18 04:18:53.612966"], ["id", 1]]

  def set_student
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]